### Connect to Pagila

In [1]:
%load_ext sql

In [2]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}@{}:{}/{}".format(DB_USER, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres@127.0.0.1:5432/pagila

In [3]:
%sql $conn_string

### Star Schema

<img src="pagila-star.png" width="50%"/>

### Start by a simple cube

In [4]:
%%sql
SELECT dimDate.day, dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate      on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer  on (dimCustomer.customer_key = factSales.customer_key)
group by (dimDate.day, dimMovie.rating, dimCustomer.city)
order by revenue desc
limit  20;

 * postgresql://postgres@127.0.0.1:5432/pagila
20 rows affected.

[(15, 'PG-13', 'Jhansi', Decimal('20.97')),
 (14, 'G', 'Qomsheh', Decimal('19.97')),
 (4, 'NC-17', 'Lapu-Lapu', Decimal('19.97')),
 (16, 'PG-13', 'Kamyin', Decimal('18.97')),
 (27, 'NC-17', 'Sincelejo', Decimal('18.97')),
 (2, 'NC-17', 'Shubra al-Khayma', Decimal('18.97')),
 (4, 'R', 'Siegen', Decimal('18.96')),
 (1, 'PG', 'Izumisano', Decimal('18.96')),
 (17, 'R', 'Athenai', Decimal('17.98')),
 (24, 'PG', 'Memphis', Decimal('17.98')),
 (3, 'PG', 'Cape Coral', Decimal('17.98')),
 (24, 'PG', 'Talavera', Decimal('17.98')),
 (3, 'G', 'Santa Brbara dOeste', Decimal('17.97')),
 (5, 'PG-13', 'Karnal', Decimal('17.97')),
 (13, 'G', 'Cape Coral', Decimal('17.97')),
 (13, 'G', 'Touliu', Decimal('16.98')),
 (8, 'PG-13', 'Probolinggo', Decimal('16.98')),
 (3, 'G', 'Rajkot', Decimal('16.98')),
 (22, 'NC-17', 'Osmaniye', Decimal('16.98')),
 (16, 'PG-13', 'Cuauhtmoc', Decimal('16.98'))]

### Slicing

* Slicing is the reduction of the dimensionality of a cube by 1, e.g., 3 dimensions to 2, fixing one of the dimensions to a single value.
* The following example shows a 3-dimensional cube on the day, rating, and city.
* In the example below, `rating` is fixed to "PG-13", reducing the dimensionality.

In [5]:
%%sql
SELECT dimDate.day, dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating = 'PG-13'
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://postgres@127.0.0.1:5432/pagila
20 rows affected.

[(15, 'PG-13', 'Jhansi', Decimal('20.97')),
 (16, 'PG-13', 'Kamyin', Decimal('18.97')),
 (5, 'PG-13', 'Karnal', Decimal('17.97')),
 (8, 'PG-13', 'Probolinggo', Decimal('16.98')),
 (1, 'PG-13', 's-Hertogenbosch', Decimal('16.98')),
 (16, 'PG-13', 'Cuauhtmoc', Decimal('16.98')),
 (10, 'PG-13', 'Greensboro', Decimal('15.98')),
 (22, 'PG-13', 'Jedda', Decimal('15.98')),
 (27, 'PG-13', 'Binzhou', Decimal('14.98')),
 (21, 'PG-13', 'Otsu', Decimal('14.98')),
 (6, 'PG-13', 'Ife', Decimal('14.98')),
 (3, 'PG-13', 'Ashdod', Decimal('14.98')),
 (4, 'PG-13', 'Molodetno', Decimal('14.98')),
 (25, 'PG-13', 'Omdurman', Decimal('14.98')),
 (22, 'PG-13', 'Bellevue', Decimal('14.98')),
 (20, 'PG-13', 'Blumenau', Decimal('14.97')),
 (29, 'PG-13', 'Banjul', Decimal('13.98')),
 (24, 'PG-13', 'Naju', Decimal('13.98')),
 (14, 'PG-13', 'Brockton', Decimal('13.98')),
 (15, 'PG-13', 'Stockport', Decimal('13.98'))]

### Dicing
 - Creating a subcube, same dimensionality, less values for 2 or more dimensions

In [6]:
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating in ('PG-13', 'PG')
AND dimCustomer.city in ('Bellevue', 'Lancaster')
AND dimDate.day in ('1', '15', '30')
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://postgres@127.0.0.1:5432/pagila
3 rows affected.

[(15, 'PG-13', 'Lancaster', Decimal('8.99')),
 (1, 'PG', 'Lancaster', Decimal('6.99')),
 (30, 'PG', 'Bellevue', Decimal('0.99'))]

### Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

In [7]:
%%sql
SELECT dimDate.day, dimMovie.rating, dimCustomer.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day,  dimMovie.rating, dimCustomer.country)
ORDER by revenue desc
LIMIT  20;

 * postgresql://postgres@127.0.0.1:5432/pagila
20 rows affected.

[(18, 'PG-13', 'India', Decimal('85.85')),
 (9, 'PG-13', 'India', Decimal('80.85')),
 (27, 'PG-13', 'China', Decimal('78.81')),
 (27, 'R', 'India', Decimal('75.83')),
 (14, 'NC-17', 'India', Decimal('75.82')),
 (17, 'PG-13', 'China', Decimal('74.84')),
 (16, 'NC-17', 'China', Decimal('73.87')),
 (26, 'PG', 'India', Decimal('73.83')),
 (25, 'PG-13', 'India', Decimal('72.87')),
 (25, 'PG-13', 'China', Decimal('72.87')),
 (17, 'NC-17', 'India', Decimal('72.85')),
 (23, 'NC-17', 'India', Decimal('72.84')),
 (13, 'PG-13', 'India', Decimal('72.82')),
 (17, 'PG-13', 'India', Decimal('71.86')),
 (12, 'NC-17', 'India', Decimal('71.82')),
 (24, 'PG-13', 'China', Decimal('69.83')),
 (24, 'R', 'China', Decimal('67.89')),
 (2, 'PG-13', 'Japan', Decimal('66.87')),
 (16, 'R', 'China', Decimal('66.86')),
 (12, 'R', 'India', Decimal('66.84'))]

### Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up to  `districts`

In [8]:
%%sql
SELECT dimDate.day, dimMovie.rating, dimCustomer.district, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day, dimCustomer.district, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://postgres@127.0.0.1:5432/pagila
20 rows affected.

[(18, 'PG-13', 'West Bengali', Decimal('36.95')),
 (27, 'NC-17', 'Buenos Aires', Decimal('36.91')),
 (3, 'R', 'West Bengali', Decimal('34.94')),
 (12, 'NC-17', 'Buenos Aires', Decimal('33.92')),
 (19, 'G', 'California', Decimal('32.96')),
 (26, 'G', 'California', Decimal('32.94')),
 (9, 'PG-13', 'Buenos Aires', Decimal('30.96')),
 (24, 'G', 'England', Decimal('30.95')),
 (17, 'NC-17', 'Illinois', Decimal('29.96')),
 (19, 'G', 'Shandong', Decimal('29.95')),
 (24, 'PG-13', 'Southern Tagalog', Decimal('29.95')),
 (15, 'PG-13', 'England', Decimal('28.96')),
 (8, 'G', 'Shandong', Decimal('27.97')),
 (24, 'PG', 'California', Decimal('27.95')),
 (16, 'NC-17', 'Shandong', Decimal('26.95')),
 (30, 'PG-13', 'Buenos Aires', Decimal('26.95')),
 (3, 'PG-13', 'Southern Tagalog', Decimal('26.94')),
 (5, 'PG-13', 'Southern Tagalog', Decimal('25.97')),
 (12, 'G', 'Tamil Nadu', Decimal('25.96')),
 (26, 'PG-13', 'Shandong', Decimal('25.95'))]

### Grouping Sets
- It happens a lot that for a 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a move clever way to do that using the SQL grouping statement "GROUPING SETS"

In [33]:
%%sql
SELECT dimDate.month, dimStore.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key  = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by grouping sets ((), dimDate.month,  dimStore.country, (dimDate.month,  dimStore.country));

 * postgresql://postgres@127.0.0.1:5432/pagila
24 rows affected.

[(None, None, Decimal('67416.51')),
 (7, 'South Africa', Decimal('4956.26')),
 (5, 'New Zealand', Decimal('5643.63')),
 (2, 'South Africa', Decimal('5110.04')),
 (2, 'New Zealand', Decimal('5030.00')),
 (3, 'New Zealand', Decimal('5937.78')),
 (1, 'New Zealand', Decimal('1465.58')),
 (6, 'New Zealand', Decimal('5360.52')),
 (4, 'South Africa', Decimal('5261.55')),
 (6, 'South Africa', Decimal('5535.97')),
 (3, 'South Africa', Decimal('5487.05')),
 (5, 'South Africa', Decimal('5729.61')),
 (7, 'New Zealand', Decimal('4804.28')),
 (1, 'South Africa', Decimal('1609.26')),
 (4, 'New Zealand', Decimal('5484.98')),
 (7, None, Decimal('9760.54')),
 (1, None, Decimal('3074.84')),
 (5, None, Decimal('11373.24')),
 (4, None, Decimal('10746.53')),
 (2, None, Decimal('10140.04')),
 (6, None, Decimal('10896.49')),
 (3, None, Decimal('11424.83')),
 (None, 'South Africa', Decimal('33689.74')),
 (None, 'New Zealand', Decimal('33726.77'))]

### CUBE 
- Equivalent to what we did above (grouping sets)

In [38]:
%%sql
SELECT dimDate.month, dimStore.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);

 * postgresql://postgres@127.0.0.1:5432/pagila
24 rows affected.

[(None, None, Decimal('67416.51')),
 (7, 'South Africa', Decimal('4956.26')),
 (5, 'New Zealand', Decimal('5643.63')),
 (2, 'South Africa', Decimal('5110.04')),
 (2, 'New Zealand', Decimal('5030.00')),
 (3, 'New Zealand', Decimal('5937.78')),
 (1, 'New Zealand', Decimal('1465.58')),
 (6, 'New Zealand', Decimal('5360.52')),
 (4, 'South Africa', Decimal('5261.55')),
 (6, 'South Africa', Decimal('5535.97')),
 (3, 'South Africa', Decimal('5487.05')),
 (5, 'South Africa', Decimal('5729.61')),
 (7, 'New Zealand', Decimal('4804.28')),
 (1, 'South Africa', Decimal('1609.26')),
 (4, 'New Zealand', Decimal('5484.98')),
 (7, None, Decimal('9760.54')),
 (1, None, Decimal('3074.84')),
 (5, None, Decimal('11373.24')),
 (4, None, Decimal('10746.53')),
 (2, None, Decimal('10140.04')),
 (6, None, Decimal('10896.49')),
 (3, None, Decimal('11424.83')),
 (None, 'South Africa', Decimal('33689.74')),
 (None, 'New Zealand', Decimal('33726.77'))]

### Naive Way
- Takes 50-60% more time compared to grouping sets and cube.

In [28]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://postgres@127.0.0.1:5432/pagila
24 rows affected.
CPU times: user 3.87 ms, sys: 1.38 ms, total: 5.25 ms
Wall time: 33.7 ms

[(None, None, Decimal('67416.51')),
 (None, 'South Africa', Decimal('33689.74')),
 (None, 'New Zealand', Decimal('33726.77')),
 ('7', None, Decimal('9760.54')),
 ('1', None, Decimal('3074.84')),
 ('5', None, Decimal('11373.24')),
 ('4', None, Decimal('10746.53')),
 ('2', None, Decimal('10140.04')),
 ('6', None, Decimal('10896.49')),
 ('3', None, Decimal('11424.83')),
 ('7', 'South Africa', Decimal('4956.26')),
 ('5', 'New Zealand', Decimal('5643.63')),
 ('2', 'South Africa', Decimal('5110.04')),
 ('2', 'New Zealand', Decimal('5030.00')),
 ('3', 'New Zealand', Decimal('5937.78')),
 ('1', 'New Zealand', Decimal('1465.58')),
 ('6', 'New Zealand', Decimal('5360.52')),
 ('4', 'South Africa', Decimal('5261.55')),
 ('6', 'South Africa', Decimal('5535.97')),
 ('3', 'South Africa', Decimal('5487.05')),
 ('5', 'South Africa', Decimal('5729.61')),
 ('7', 'New Zealand', Decimal('4804.28')),
 ('1', 'South Africa', Decimal('1609.26')),
 ('4', 'New Zealand', Decimal('5484.98'))]